CMD PROMPT('Write CCSID table program')
PARM KWD(DTAARALIB) TYPE(*CHAR) LEN(10)    
PARM KWD(DTAARANME) TYPE(*CHAR) LEN(10)    
PARM KWD(TGTLIB)    TYPE(*CHAR) LEN(10)    
PARM KWD(TGTFILE)   TYPE(*CHAR) LEN(10)    
PARM KWD(TGTMBR)    TYPE(*CHAR) LEN(10)    
