PGM         PARM(&DTAARALIB &DTAARANME &TGTLIB &TGTFILE &TGTMBR)
 DCL        VAR(&DTAARALIB)  TYPE(*CHAR) LEN(10)
 DCL        VAR(&DTAARANME)  TYPE(*CHAR) LEN(10)
 DCL        VAR(&TGTLIB)     TYPE(*CHAR) LEN(10)
 DCL        VAR(&TGTFILE)    TYPE(*CHAR) LEN(10)
 DCL        VAR(&TGTMBR)     TYPE(*CHAR) LEN(10)
 DCL        VAR(&DTAARA)     TYPE(*CHAR) LEN(204)
 DCL        VAR(&FLAG_O)     TYPE(*INT)  LEN(4)  VALUE(16777228)
 DCL        VAR(&FD_O)       TYPE(*INT)  LEN(4)                         
 DCL        VAR(&TOTAL)      TYPE(*INT)  LEN(4) 
 DCL        VAR(&TOMBR)      TYPE(*CHAR) LEN(150)
 DCL        VAR(&TOMBR_O)    TYPE(*CHAR) LEN(151)
 DCL        VAR(&NULL)       TYPE(*CHAR) LEN(1) VALUE(X'00')
 DCL        VAR(&COUNT)      TYPE(*INT)  LEN(4)    
 CRTSRCPF FILE(&TGTLIB/&TGTFILE) RCDLEN(28) MBR(&TGTMBR)
 CHGVAR VAR(&TOMBR) VALUE('/QSYS.LIB/' *CAT &TGTLIB *TCAT '.LIB/' *CAT +
               &TGTFILE *TCAT '.FILE/' *CAT &TGTMBR *TCAT '.MBR' *TCAT &NULL)
 RTVDTAARA  DTAARA(&DTAARALIB/&DTAARANME *ALL) RTNVAR(&DTAARA)  
 CHGVAR VAR(&TOTAL) VALUE(%SIZE(&DTAARA))
 CALLPRC PRC('open')  PARM((&TOMBR *BYREF) (&FLAG_O *BYVAL)) RTNVAL(&FD_O) 
 CALLPRC PRC('write') PARM((&FD_O *BYVAL) (&DTAARA *BYREF) (&TOTAL *BYVAL)) RTNVAL(&COUNT)
 CALLPRC PRC('close') PARM((&FD_O *BYVAL))
ENDPGM
